app/controllers/prototypes_controller.rb

  def destroy
      prototype = Prototype.find(params[:id])
      if prototype.user_id == current_user.id
        prototype.destroy
---
SELECT  `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 10 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 10